//С клавиатуры вводится информация о студентах: фамилия, имя, оцен-
//ки. Выведите на экран информацию о трех лучших студентах по сред-
//нему баллу. В случае, если у нескольких студентов средний балл сов-
//падает, то выведите большее число студентов (пока не будут выведе-
//ны все студенты или не будут полностью исчерпаны студенты с тремя
//лучшими баллами). Вывод надо осуществлять в порядке убывания
//среднего балла, а для одинаковых средних баллов – в алфавитном
//порядке по фамилии и имени.

fun main() {
    // Cафронов Александр Дмитриевич 5 2 3 4 5 4 5 4
    val buff:String
    do{
        val buff= readLine()
        println(buff)
    }while(buff!=null)
}